
&НаКлиенте
Процедура ДобавитьФото(Команда)
	// Вставить содержимое обработчика. 
	ИмяФайла = "";	ПутьФайла = "";	//Вызываем Диалоговое окно и помещаем файл Картинки из локальной файловой системы во временное хранилище	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда 	//в строковый реквизит ФОТО нашей формы сохраняем ссылку на Картинку во временном хранилище	Фото = ПутьФайла;	//для создания нового элемента в Справочнике Файлы и записи Картинки в его реквизит Файл	//переходим на сервер с помощью вызова серверной процедуры	УстановитьФото();	КонецЕсли; 	//условие ЕСЛИ нужно для того, чтобы если пользователь отказался от выбора файла	//мы не вызывали серверную процедуру УстановитьФото()
КонецПроцедуры              

&НаСервере	Процедура УстановитьФото()	//создаем новый элемент в Справочнике ФотоПользователей	НовыйФайлКартинки = Справочники.ФотоПользователей.СоздатьЭлемент(); 	//в реквизит СправочникаФайлы Файл помещаем выбранную ранее Картинку	НовыйФайлКартинки.ФайлФото = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));	Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.ФайлФото.Получить());	//записываем новый элемент справочника Файлы	НовыйФайлКартинки.Записать();	//устанавливаем значение реквизита Картинка Справочника Сотрудники	Объект.Фото = НовыйФайлКартинки.Ссылка;КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//отображение картинки при открытии формы справочника	Фото = ПолучитьНавигационнуюСсылку(Объект.Фото, "ФайлФото");	//устанавливаем автомасштаб для картинки	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;   
КонецПроцедуры
