
&НаСервере
Процедура АвтомобильПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	ОбЪект.Водитель = Объект.Автомобиль.Водитель;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиГСМОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиГСМ.Остатки(
		|			&Дата,
		|			&ТС = &ТС
		|				И &ВидГСМ = &ВидГСМ) КАК ОстаткиГСМОстатки";
	
	Запрос.УстановитьПараметр("ВидГСМ", Объект.Автомобиль.Модель.Топливо);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ТС", Объект.Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.ТопливоПриВыезде = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	АвтомобильПриИзмененииНаСервере();
КонецПроцедуры

