
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПутевойЛист.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПутевойЛист.Автомобиль,
	|	ПутевойЛист.Водитель,
	|	ПутевойЛист.Дата,
	|	ПутевойЛист.Номер,
	|	ПутевойЛист.ТопливоПоПриезду,
	|	ПутевойЛист.ТопливоПриВыезде
	|ИЗ
	|	Документ.ПутевойЛист КАК ПутевойЛист
	|ГДЕ
	|	ПутевойЛист.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);                     
		
		//Шапка.Параметры.Потрачено = 0;
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;  
		//ТопливоПриВыезде = Выборка.ТопливоПриВыезде.Выбрать();
		//ТопливоПоПриезду = Выборка.ТопливоПоПриезду.Выбрать();
	КонецЦикла;
	//}}
КонецПроцедуры
